Repository: GymTrackerr/gym-track-xcode
Catalog: GymTracker/GymTracker/Localization/Progression.xcstrings
Source language: en_gb
Languages: es, fr

# progression.action.addProfile
source: Add Profile
es: Añadir perfil
fr: Ajouter un profil

# progression.action.cancel
source: Cancel
es: Cancelar
fr: Annuler

# progression.action.delete
source: Delete
es: Eliminar
fr: Supprimer

# progression.action.edit
source: Edit
es: Editar
fr: Modifier

# progression.action.removeOverride
source: Remove Override
es: Eliminar ajuste
fr: Supprimer le remplacement

# progression.action.save
source: Save
es: Guardar
fr: Enregistrer

# progression.action.set
source: Set
es: Configurar
fr: Définir

# progression.assignmentSource.exerciseOverride
source: Exercise Override
es: Ajuste del ejercicio
fr: Remplacement de l’exercice

# progression.assignmentSource.programmeDefault
source: Programme Default
es: Predeterminado del programa
fr: Valeur par défaut du programme

# progression.assignmentSource.routineDefault
source: Routine Default
es: Predeterminado de la rutina
fr: Valeur par défaut de la routine

# progression.assignmentSource.userDefault
source: Global Default
es: Predeterminado global
fr: Valeur par défaut globale

# progression.badge.default
source: DEFAULT
es: PREDETERMINADO
fr: PAR DÉFAUT

# progression.builtIn.doubleProgression.description
source: Build reps inside a range before moving the weight up.
es: Aumenta las repeticiones dentro de un rango antes de subir el peso.
fr: Augmentez les répétitions dans une plage avant d’augmenter la charge.

# progression.builtIn.linear.description
source: Increase the load by a small amount after a successful session.
es: Aumenta un poco la carga después de una sesión exitosa.
fr: Augmentez légèrement la charge après une séance réussie.

# progression.builtIn.volume.description
source: Add more sets over time while keeping reps steady.
es: Añade más series con el tiempo manteniendo las repeticiones estables.
fr: Ajoutez progressivement des séries tout en gardant les répétitions stables.

# progression.detail.advancement
source: Advancement
es: Avance
fr: Progression

# progression.detail.cycle
source: Cycle
es: Ciclo

# progression.detail.defaultTarget
source: Default Target
es: Objetivo predeterminado
fr: Objectif par défaut

# progression.detail.exercise
source: Exercise
es: Ejercicio
fr: Exercice

# progression.detail.following
source: Following
es: Siguiendo
fr: Suit

# progression.detail.lastTopSet
source: Last Top Set
es: Última serie máxima
fr: Dernière meilleure série

# progression.detail.profile
source: Profile
es: Perfil
fr: Profil

# progression.detail.source
source: Source
es: Origen

# progression.detail.target
source: Target
es: Objetivo
fr: Objectif

# progression.detail.type
source: Type
es: Tipo

# progression.exerciseOverride.automaticSourceDescription
source: %@ is currently handling this exercise. Saving here will turn this into an exercise-only override.
es: %@ está gestionando este ejercicio. Al guardar aquí, se convertirá en un ajuste solo para este ejercicio.
fr: %@ gère actuellement cet exercice. En enregistrant ici, vous créerez un remplacement propre à cet exercice.

# progression.exerciseOverride.emptyDescription
source: Set an exercise-only override. If you leave this empty, routine, programme, or global defaults can still apply automatically.
es: Configura un ajuste solo para este ejercicio. Si lo dejas vacío, los valores de rutina, programa o globales podrán aplicarse automáticamente.
fr: Définissez un remplacement propre à cet exercice. Si vous le laissez vide, les valeurs par défaut de routine, de programme ou globales peuvent toujours s’appliquer automatiquement.

# progression.exerciseOverride.noOverride
source: No exercise override yet. Routine, programme, or global defaults can still apply automatically when you start logging.
es: Aún no hay ajuste para este ejercicio. Los valores de rutina, programa o globales podrán aplicarse automáticamente cuando empieces a registrar.
fr: Aucun remplacement d’exercice pour le moment. Les valeurs par défaut de routine, de programme ou globales peuvent toujours s’appliquer automatiquement quand vous commencez à enregistrer.

# progression.exerciseOverride.savedDescription
source: Saved target guidance for this exercise.
es: Guía de objetivos guardada para este ejercicio.
fr: Objectifs enregistrés pour cet exercice.

# progression.exerciseOverride.title
source: Exercise Override
es: Ajuste del ejercicio
fr: Remplacement de l’exercice

# progression.field.description
source: Description
es: Descripción

# progression.field.incrementUnit
source: Increment Unit
es: Unidad de incremento
fr: Unité d’incrément

# progression.field.name
source: Name
es: Nombre
fr: Nom

# progression.field.percentageIncrease
source: Percentage Increase
es: Aumento porcentual
fr: Augmentation en pourcentage

# progression.field.progression
source: Progression
es: Progresión

# progression.field.type
source: Type
es: Tipo

# progression.field.weightIncrement
source: Weight Increment
es: Incremento de peso
fr: Incrément de poids

# progression.placeholder.miniDescription
source: Mini Description
es: Descripción breve
fr: Description courte

# progression.placeholder.required
source: Required
es: Obligatorio
fr: Obligatoire

# progression.profile.defaultProfile
source: Default Profile
es: Perfil predeterminado
fr: Profil par défaut

# progression.profileEditor.editTitle
source: Edit Profile
es: Editar perfil
fr: Modifier le profil

# progression.profileEditor.newTitle
source: New Profile
es: Nuevo perfil
fr: Nouveau profil

# progression.profileEditor.section.advancement
source: Advancement
es: Avance
fr: Progression

# progression.profileEditor.section.profile
source: Profile
es: Perfil
fr: Profil

# progression.profileEditor.section.targets
source: Targets
es: Objetivos
fr: Objectifs

# progression.profiles.automatic.enable
source: Enable progression for everything
es: Activar progresión para todo
fr: Activer la progression pour tout

# progression.profiles.automatic.orderDescription
source: Session source still wins first: exercise override, then programme default, then routine default, and this global default fills the gaps.
es: La fuente de la sesión sigue teniendo prioridad: ajuste del ejercicio, luego predeterminado del programa, luego de la rutina, y este valor global cubre lo restante.
fr: La source de la séance reste prioritaire : remplacement de l’exercice, puis valeur par défaut du programme, puis de la routine, et cette valeur globale complète le reste.

# progression.profiles.automatic.subtitle
source: Enable this if you want every routine-less exercise to fall back to one default profile when no exercise, routine, or programme override is set.
es: Actívalo si quieres que cada ejercicio sin rutina use un perfil predeterminado cuando no haya ajuste de ejercicio, rutina o programa.
fr: Activez ceci pour que chaque exercice sans routine utilise un profil par défaut lorsqu’aucun remplacement d’exercice, de routine ou de programme n’est défini.

# progression.profiles.automatic.title
source: Automatic Progression
es: Progresión automática
fr: Progression automatique

# progression.profiles.builtIn.loading
source: Built-in profiles are still loading.
es: Los perfiles integrados todavía se están cargando.
fr: Les profils intégrés sont encore en cours de chargement.

# progression.profiles.builtIn.subtitle
source: These seed from JSON once, live in the database after that, and can be tuned for your defaults.
es: Se cargan una vez desde JSON, luego viven en la base de datos y se pueden ajustar a tus valores predeterminados.
fr: Ils sont initialisés une fois depuis JSON, puis vivent dans la base de données et peuvent être ajustés à vos valeurs par défaut.

# progression.profiles.builtIn.title
source: Built-in Progressions
es: Progresiones integradas
fr: Progressions intégrées

# progression.profiles.custom.empty
source: No custom profiles yet.
es: Aún no hay perfiles personalizados.
fr: Aucun profil personnalisé pour le moment.

# progression.profiles.custom.subtitle
source: Create extra progression setups for exercises that need different targets or increments.
es: Crea configuraciones adicionales para ejercicios que necesiten objetivos o incrementos distintos.
fr: Créez des progressions supplémentaires pour les exercices qui nécessitent des objectifs ou des incréments différents.

# progression.profiles.custom.title
source: Custom Profiles
es: Perfiles personalizados
fr: Profils personnalisés

# progression.section.automaticSource
source: Automatic Source
es: Origen automático
fr: Source automatique

# progression.sessionDetails.currentCycle
source: Current Cycle
es: Ciclo actual
fr: Cycle actuel

# progression.sessionDetails.noSnapshot
source: No progression target was snapped into this session entry yet. Once the exercise is started from a routine, programme, or exercise progression, the targets will show here.
es: Aún no se guardó ningún objetivo de progresión en esta entrada de sesión. Cuando el ejercicio se inicie desde una rutina, programa o progresión de ejercicio, los objetivos aparecerán aquí.
fr: Aucun objectif de progression n’a encore été enregistré dans cette entrée de séance. Une fois l’exercice lancé depuis une routine, un programme ou une progression d’exercice, les objectifs s’afficheront ici.

# progression.stepper.defaultSets
source: Default Sets: %lld
es: Series predeterminadas: %lld
fr: Séries par défaut : %lld

# progression.stepper.repRangeHigh
source: Rep Range High: %lld
es: Rango alto de repeticiones: %lld
fr: Haut de plage de répétitions : %lld

# progression.stepper.repRangeLow
source: Rep Range Low: %lld
es: Rango bajo de repeticiones: %lld
fr: Bas de plage de répétitions : %lld

# progression.stepper.setIncrement
source: Set Increment: %lld
es: Incremento de series: %lld
fr: Incrément de séries : %lld

# progression.stepper.sets
source: Sets: %lld
es: Series: %lld
fr: Séries : %lld

# progression.stepper.successThreshold
source: Success Threshold: %lld
es: Umbral de éxito: %lld
fr: Seuil de réussite : %lld

# progression.stepper.targetReps
source: Target Reps: %lld
es: Repeticiones objetivo: %lld
fr: Répétitions cibles : %lld

# progression.targetCard.aboveTarget
source: Above target
es: Por encima del objetivo
fr: Au-dessus de l’objectif

# progression.targetCard.aboveTargetOnSet
source: Above target on this set
es: Por encima del objetivo en esta serie
fr: Au-dessus de l’objectif sur cette série

# progression.targetCard.missedTarget
source: Missed target on this set
es: Objetivo no alcanzado en esta serie
fr: Objectif manqué sur cette série

# progression.targetCard.nextTarget
source: Next target
es: Siguiente objetivo
fr: Prochain objectif

# progression.targetCard.nextTarget.title
source: Next Target
es: Siguiente objetivo
fr: Prochain objectif

# progression.targetCard.onTarget
source: On target
es: En objetivo
fr: Dans l’objectif

# progression.targetCard.perSetGoal
source: Per Set Goal
es: Objetivo por serie
fr: Objectif par série

# progression.title
source: Progression
es: Progresión

# progression.type.doubleProgression
source: Double Progression
es: Doble progresión

# progression.type.linear
source: Load Progression
es: Progresión de carga
fr: Progression de charge

# progression.type.volume
source: Volume Progression
es: Progresión de volumen
fr: Progression du volume

# progression.value.automaticProgression
source: Automatic progression
es: Progresión automática
fr: Progression automatique

# progression.value.custom
source: Custom
es: Personalizado
fr: Personnalisé

# progression.value.noSavedCycle
source: No saved cycle yet.
es: Aún no hay ciclo guardado.
fr: Aucun cycle enregistré pour le moment.

# progression.value.noSavedProgression
source: No saved progression
es: No hay progresión guardada
fr: Aucune progression enregistrée

# progression.value.none
source: None
es: Ninguno
fr: Aucun

# progression.routine.defaultProgression
source: Default Progression
es: Progresión predeterminada
fr: Progression par défaut

# progression.routine.description
source: Routine sessions will automatically apply this profile to exercises that do not already have their own saved progression.
es: Las sesiones de rutina aplicarán automáticamente este perfil a los ejercicios que aún no tengan su propia progresión guardada.
fr: Les séances de routine appliqueront automatiquement ce profil aux exercices qui n’ont pas déjà leur propre progression enregistrée.

# progression.routine.title
source: Routine Progression
es: Progresión de rutina
fr: Progression de routine

# progression.cycleSummary.setCount
source: %lld sets
es: %lld series
fr: %lld séries

# progression.cycleSummary.linearWithWeight
source: Hit %@ at %@ reps, then add load. Current target: %@.
es: Completa %@ con %@ repeticiones y luego aumenta la carga. Objetivo actual: %@.
fr: Atteignez %@ à %@ répétitions, puis augmentez la charge. Objectif actuel : %@.

# progression.cycleSummary.linear
source: Hit %@ at %@ reps, then add load.
es: Completa %@ con %@ repeticiones y luego aumenta la carga.
fr: Atteignez %@ à %@ répétitions, puis augmentez la charge.

# progression.cycleSummary.doubleLastCycle
source: Last cycle topped out at %@ x %lld. Choose %@ and restart at %@ reps.
es: El último ciclo llegó hasta %@ x %lld. Elige %@ y reinicia con %@ repeticiones.
fr: Le dernier cycle s'est terminé à %@ x %lld. Choisissez %@ et repartez à %@ répétitions.

# progression.cycleSummary.doubleChoose
source: Choose %@ and restart at %@ reps.
es: Elige %@ y reinicia con %@ repeticiones.
fr: Choisissez %@ et repartez à %@ répétitions.

# progression.cycleSummary.doubleCurrentCycle
source: Current cycle: %@ for %lld x %@. Goal this time: %@ reps on every set.
es: Ciclo actual: %@ para %lld x %@. Objetivo esta vez: %@ repeticiones en cada serie.
fr: Cycle actuel : %@ pour %lld x %@. Objectif cette fois : %@ répétitions à chaque série.

# progression.cycleSummary.doubleBuildRange
source: Build each set through the %@ range. Goal this time: %@ reps.
es: Aumenta cada serie dentro del rango %@. Objetivo esta vez: %@ repeticiones.
fr: Faites progresser chaque série dans la plage %@. Objectif cette fois : %@ répétitions.

# progression.cycleSummary.volumeWithWeight
source: Keep %@ steady and build up to %@.
es: Mantén %@ estable y sube hasta %@.
fr: Gardez %@ stable et montez jusqu'à %@.

# progression.cycleSummary.volume
source: Keep the load steady and build up to %@.
es: Mantén la carga estable y sube hasta %@.
fr: Gardez la charge stable et montez jusqu'à %@.

# progression.value.manual
source: Manual
fr: Manuel
